pascal-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/rgs2D_Coarse/system/region_buffer/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                               none;
}

gradSchemes
{
    default                               none;

    grad(cellMotionU)                     Gauss linear;
}

divSchemes
{
    default                               none;
}

laplacianSchemes
{
    default                               none;

    laplacian(diffusivity,cellMotionU)    Gauss linear corrected;
}

interpolationSchemes
{
    default                               none;

    interpolate(y)                        linear;
    interpolate(grad(cellMotionU))        linear;
}

// ************************************************************************* //
