pascal-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/rgs2D_Coarse/system/region_fluid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        trackedSurface
        {
            type            directMappedPatch;
            sampleMode      nearestPatchFace;
            sampleRegion    region_buffer;
            samplePatch     trackedSurface;
            offset          (0 0 0);
        }

//         movingWall
//         {
//             type            directMappedWall;
//             sampleMode      nearestPatchFace;
//             sampleRegion    region_static;
//             samplePatch     movingWall;
//             offset          (0 0 0);
//         }

        fixedWall
        {
            type            directMappedWall;
            sampleMode      nearestPatchFace;
            sampleRegion    region_buffer;
            samplePatch     fixedWall;
            offset          (0 0 0);
        }
    }
}

// ************************************************************************* //
