pascal-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/rgs2D_Coarse/system/region_space/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

matchTolerance           1e-6;

pointSync                true;

patchInfo
(
    {
        name             conductorSurface;
        constructFrom    patches;
        patches          (region_space_to_region_conductor);

        dictionary
        {
            type         patch;
        }
    }
);

// ************************************************************************* //
